; domain
(define (domain fetch-domain)
  (:requirements :strips :typing)
  
  (:types
    room - object
    robot - object
    treat - object
  )
  
  (:predicates
    (at ?robot - robot ?room - room)
    (treat-at ?treat - treat ?room - room)
    (holding ?robot - robot ?treat - treat)
    (connected ?room1 - room ?room2 - room)
    (empty-handed ?robot - robot)
  )
  
  (:action move
    :parameters (?robot - robot ?from - room ?to - room)
    :precondition (and 
      (at ?robot ?from)
      (connected ?from ?to)
    )
    :effect (and 
      (not (at ?robot ?from))
      (at ?robot ?to)
    )
  )
  
  (:action pickup
    :parameters (?robot - robot ?treat - treat ?room - room)
    :precondition (and 
      (at ?robot ?room)
      (treat-at ?treat ?room)
      (empty-handed ?robot)
    )
    :effect (and 
      (not (treat-at ?treat ?room))
      (not (empty-handed ?robot))
      (holding ?robot ?treat)
    )
  )
  
  (:action drop
    :parameters (?robot - robot ?treat - treat ?room - room)
    :precondition (and 
      (at ?robot ?room)
      (holding ?robot ?treat)
    )
    :effect (and 
      (not (holding ?robot ?treat))
      (treat-at ?treat ?room)
      (empty-handed ?robot)
    )
  )
)

; problem
(define (problem fetch-problem)
  (:domain fetch-domain)
  
  (:objects 
    robot1 - robot
    treat1 - treat
    rooma roomb roomc roomd - room
  )
  
  (:init 
    (at robot1 rooma)
    (treat-at treat1 roomd)
    (empty-handed robot1)
    (connected rooma roomb)
    (connected roomb rooma)
    (connected rooma roomc)
    (connected roomc rooma)
    (connected roomb roomd)
    (connected roomd roomb)
    (connected roomc roomd)
    (connected roomd roomc)
  )
  
  (:goal 
    (and
      (at robot1 rooma)
      (treat-at treat1 rooma)
    )
  )
)

; plan
1. (move robot1 rooma roomb)
   deleted: (at robot1 rooma)
   added: (at robot1 roomb)
   goals met: 0 of 2
2. (move robot1 roomb roomd)
   deleted: (at robot1 roomb)
   added: (at robot1 roomd)
   goals met: 0 of 2
3. (pickup robot1 treat1 roomd)
   deleted: (treat-at treat1 roomd) (empty-handed robot1)
   added: (holding robot1 treat1)
   goals met: 0 of 2
4. (move robot1 roomd roomb)
   deleted: (at robot1 roomd)
   added: (at robot1 roomb)
   goals met: 0 of 2
5. (move robot1 roomb rooma)
   deleted: (at robot1 roomb)
   added: (at robot1 rooma)
   goals met: 1 of 2
6. (drop robot1 treat1 rooma)
   deleted: (holding robot1 treat1)
   added: (treat-at treat1 rooma) (empty-handed robot1)
   goals met: 2 of 2
